---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredNdfType
source: html/b7c11d4f-2669-d9b5-ed1f-b48e267adca0.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.LayeredNdfType Property

The property labeled "NDF" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string LayeredNdfType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "LayeredNdfType".